RDVMI.rdvmi-ext/src/Catalogs/рдв_ВыгружаемыеОбъекты/рдв_ВыгружаемыеОбъекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рдв_ВыгружаемыеОбъекты</name>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.рдв_ТипыВыгружаемыхОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>125</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Успешно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтборНабораЗаписей</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RDVMI.rdvmi-ext/src/Enums/рдв_ТипыВыгружаемыхОбъектов/рдв_ТипыВыгружаемыхОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рдв_ТипыВыгружаемыхОбъектов</name>
  <enumValues>
    <name>Ссылка</name>
  </enumValues>
  <enumValues>
    <name>НаборЗаписей</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеПолучения</name>
  </enumValues>
  <enumValues>
    <name>Произвольный</name>
  </enumValues>
</mdclass:Enum>

RDVMI.rdvmi-ext/src/Catalogs/рдв_ВыгружаемыеОбъекты/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	УправлениеВидимостью();
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()
	
	Элементы.ГруппаСсылка.Видимость = Ложь;
	Элементы.ГруппаНаборЗаписей.Видимость = Ложь;
	Элементы.ГруппаПодтверждениеПолучения.Видимость = Ложь;
	
	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.рдв_ТипыВыгружаемыхОбъектов.Ссылка") Тогда
		Элементы.ГруппаСсылка.Видимость = Истина;
	ИначеЕсли Объект.Тип = ПредопределенноеЗначение("Перечисление.рдв_ТипыВыгружаемыхОбъектов.НаборЗаписей") Тогда
		Элементы.ГруппаНаборЗаписей.Видимость = Истина;
	ИначеЕсли Объект.Тип = ПредопределенноеЗначение("Перечисление.рдв_ТипыВыгружаемыхОбъектов.ПодтверждениеПолучения") Тогда
		Элементы.ГруппаПодтверждениеПолучения.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Тип) Тогда
		Объект.Тип = Перечисления.рдв_ТипыВыгружаемыхОбъектов.Ссылка;
	КонецЕсли;
	
КонецПроцедуры
